app/controllers/movies_controller.rb

      session[:sort] = params[:sort]
      if (params[:sort] == "title") #TITLE
        if (params[:ratings] or params[:filter] != "[]")
          @movies = Movie.find(:all, :conditions => {:rating => (@myFilter==[] ? @all_ratings : @myFilter)}, :order => "title")
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" = '["G", "R", "NC-17"]' ORDER BY title

        if (params[:ratings] or params[:filter] != "[]") # filter ratings
          @movies = Movie.find(:all, :conditions => {:rating => (@myFilter==[] ? @all_ratings : @myFilter)})
        else
          @movies = Movie.all
---
SELECT "movies".* FROM "movies" ORDER BY release_date